[Killed] BlockStatement
blog-example-code/012/src/simpleTest.ts:1:55
-export function addFunc(x: number, y: number): number {
-  return x + y;
-}
+export function addFunc(x: number, y: number): number {}
killedBy: adds 1 + 2 to equal 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
blog-example-code/012/src/simpleTest.ts:2:10
 export function addFunc(x: number, y: number): number {
-  return x + y;
+  return x - y;
 }
killedBy: adds 1 + 2 to equal 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1
